<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"66b563d44f5b43f1ba4ccb5fe1192c17fbf355a6ea4461aafbe8be841f40eddf","plan_job_ref":"Job Create terraform plan #13 at https://github.com/leonitousconforti/infra/actions/runs/15418931665","plan_out_hash":"ab41bb9983cd94f7e6f09e930af2e78d0581d3e5e9fcc2213bf62d46c3d4817b","plan_hash":"fac4be8f1c563d1a1d0fa3885efcba71d82605eedb3d0b736fa4bed2f02a4ee2","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __leoconforti.us__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.leoconforti_us will be created
+   resource "digitalocean_domain" "leoconforti_us" {
+       id   = (known after apply)
+       name = "leoconforti.us"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_project_resources.leoconforti_us_project will be created
+   resource "digitalocean_project_resources" "leoconforti_us_project" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_record.dmarc will be created
+   resource "digitalocean_record" "dmarc" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "_dmarc"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DMARC1; p=quarantine; rua=mailto:25f8c5e6@mxtoolbox.dmarc-report.com; ruf=mailto:25f8c5e6@forensics.dmarc-report.com; fo=1"
    }

  # digitalocean_record.domainkey will be created
+   resource "digitalocean_record" "domainkey" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "default._domainkey"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQDdEz47qw+QP7JOcA4BHUGtaEvscizOD4EL7OUQqtWtT06gwh6cnLw3yKA9loYMlj8VLVl23dj/3oTg+XeJABLdF+UDcJYsjW0ysD+n5EbXsXRapFf6tnHIqxkRLlXIxpuYhHja0P0Y+RTXyOqv0RdK3hH/f+vQzMkJLJDxf3kZvwIDAQAB"
    }

  # digitalocean_record.mx1 will be created
+   resource "digitalocean_record" "mx1" {
+       domain   = "leoconforti.us"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 10
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd1.porkbun.com"
    }

  # digitalocean_record.mx2 will be created
+   resource "digitalocean_record" "mx2" {
+       domain   = "leoconforti.us"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 20
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd2.porkbun.com"
    }

  # digitalocean_record.ns1 will be created
+   resource "digitalocean_record" "ns1" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leoconforti.us"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns1.digitalocean.com"
    }

  # digitalocean_record.ns2 will be created
+   resource "digitalocean_record" "ns2" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leoconforti.us"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns2.digitalocean.com"
    }

  # digitalocean_record.ns3 will be created
+   resource "digitalocean_record" "ns3" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "leoconforti.us"
+       ttl    = 1800
+       type   = "NS"
+       value  = "ns3.digitalocean.com"
    }

  # digitalocean_record.sfp will be created
+   resource "digitalocean_record" "sfp" {
+       domain = "leoconforti.us"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "@"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=spf1 mx include:_spf.porkbun.com ~all"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #13](https://github.com/leonitousconforti/infra/actions/runs/15418931665)